import { TimeLineItem } from "./types";

export const data: TimeLineItem[] = [
  {
    startYear: 1984,
    endYear: 1999,
    name: "Кино",
    achievements: [
      {
        year: 1984,
        description:
          "Единственная часть тела, которая не имеет кровоснабжения, - роговица глаза. Кислород она получает непосредственно из воздуха.",
      },
      {
        year: 1985,
        description: "Емкость мозга человека превышает 4 терабайта.",
      },
      {
        year: 1986,
        description:
          "До 7 месяцев ребенок может дышать и глотать одновременно.",
      },
      {
        year: 1987,
        description: "Ваш череп состоит из 29 различных костей.",
      },
      {
        year: 1988,
        description: "Нервный импульс из мозга движется со скоростью 274 км/ч.",
      },
    ],
  },
  {
    startYear: 1999,
    endYear: 2002,
    name: "Музыка",
    achievements: [
      {
        year: 1999,
        description:
          "Законодательство США допускало отправку детей по почте до 1913 года.",
      },
      {
        year: 2000,
        description: "В языке древних греков не существовало слова, которое обозначало религию.",
      },
      {
        year: 2001,
        description:
          "В современной истории есть промежуток времени, когда на счетах компании «Apple», было больше средств, чем у американского правительства.",
      },
      {
        year: 2002,
        description: "Среднее облако весит порядка 500 тонн, столько же весят 80 слонов.",
      },
      {
        year: 2002,
        description: "В Ирландии никогда не было кротов.",
      },
    ],
  },
  {
    startYear: 2002,
    endYear: 2010,
    name: "Наука",
    achievements: [
      {
        year: 2004,
        description:
          "Флот США содержит больше авианосцев, чем все флоты мира вместе взятые.",
      },
      {
        year: 2010,
        description: "Скорость распространения лавы после извержения, близка к скорости бега гончей.",
      },      
    ],
  },
  {
    startYear: 2011,
    endYear: 2015,
    name: "Литература",
    achievements: [
      {
        year: 2011,
        description:
          "Изначально, отвертка была изобретена для выковыривания гвоздей, шуруп был изобретен на 100 лет позже.",
      },
      {
        year: 2012,
        description: "Библия – книга, которую чаще всего воруют в американских магазинах.",
      },
      {
        year: 2013,
        description:
          "Примерно 1/3 всей соли, производимой в США, расходуется на очистку дорог ото льда.",
      },
      {
        year: 2014,
        description: "Существует пробирка, диаметр которой, в 10000 раз меньше диаметра человеческого волоса.",
      },
      {
        year: 2015,
        description: "Саудовская Аравия не содержит рек.",
      },
    ],
  },
  {
    startYear: 2016,
    endYear: 2020,
    name: "Техника",
    achievements: [
      {
        year: 1984,
        description:
          "В Антарктиде существует единственная река – Оникс, она течет всего 60 дней в году.",
      },
      {
        year: 1985,
        description: "У медуз нет мозгов и кровеносных сосудов.",
      },     
    ],
  },
  {
    startYear: 2020,
    endYear: 2024,
    name: "Культура",
    achievements: [
      {
        year: 2020,
        description:
          "Ежедневно 60 человек становятся миллионерами.",
      },
      {
        year: 2020,
        description: "До 17 века термометры заполняли коньяком.",
      },
      {
        year: 2021,
        description:
          "Кошки спят больше половины своей жизни.",
      },
      {
        year: 2021,
        description: "Лимон содержит больше сахара, чем клубника.",
      },
      {
        year: 2022,
        description: "Самый долгий полёт курицы продолжался 13 секунд.",
      },
      {
        year: 2023,
        description: "Ладожское озеро является самым большим в Европе.",
      },
      {
        year: 2024,
        description: "За год на Землю падает до 500 кг марсианского метеорита.",
      },
    ],
  },
];
